{"id": "3c6ed726ccd437d0", "source_type": "docx", "source_name": "specs.docx", "chunk_id": 0, "text": "Product Specifications Document Product Name: NimbusTrack Version: 1.0 Date: August 4, 2025 Prepared By: Product Management Team 1. Introduction NimbusTrack is a cloud-based asset tracking and analytics platform designed for mid-to-enterprise-level organizations. It enables real-time location monitoring, usage analytics, and predictive maintenance alerts for physical assets, reducing downtime and improving operational efficiency. 2. Scope This document outlines the functional, non-functional, and technical requirements for the NimbusTrack platform. It serves as a reference for the development, QA, and deployment teams. 3. Functional Requirements 3.1 Asset Registration Ability to create, edit, and delete asset profiles. Bulk import of assets via CSV and API. Customizable asset fields (up to 25 per organization). 3.2 Real-Time Tracking GPS and RFID-based location updates every 15 seconds. Map-based visualization with clustering for >500 assets. Geo-fencing alerts when assets leave predefined zones. 3.3 Usage Analytics Dashboard for asset utilization rates. Predictive maintenance suggestions based on historical data. Exportable reports (PDF, XLSX, CSV). 3.4 User Management Role-based access control (Admin, Manager, Viewer). Multi-factor authentication. SSO integration (OAuth 2.0, SAML). 4. Non-Functional Requirements Performance: System must handle 50,000 concurrent assets without >1 sec delay in location updates. Availability: 99.95% uptime SLA. Security: AES-256 encryption for data in transit and at rest. Scalability: Horizontal scaling on AWS using Kubernetes. 5. Technical Specifications Frontend: React 18, TailwindCSS, Mapbox API. Backend: Node.js 20, Express.js, PostgreSQL 16. Hosting: AWS EC2, RDS, and S3. APIs: REST + WebSocket for live updates. CI/CD: GitHub Actions + AWS CodeDeploy. 6. Testing & Quality Assurance Automated unit and integration tests covering 85% of codebase. Load testing with 10x projected traffic. Monthly security penetration tests. 7. Delivery Timeline 8. Risks & Assumptions GPS accuracy may vary in underground or high-rise environments. Customer must provide API keys for third-party integrations. Internet connectivity is required for real-time features. 9. Approval", "metadata": {"file_path": "C:/Users/gleblanc/OneDrive - Corporate Services, LLC/Documents/Python/Ingestor/specs.docx", "chunk_index": 0, "original_length_words": 299}}
{"id": "1f1bb104b02292d1", "source_type": "pdf", "source_name": "nimbustrack_release_notes.pdf", "chunk_id": "0_0", "text": "NimbusTrack Release Notes - Version 1.0 Release Date: August 4, 2025 NimbusTrack is a cloud-based asset tracking and analytics platform. This release introduces the initial core features for enterprise-grade asset management. New Features - Asset Registration: Create, edit, delete, and bulk import asset profiles. - Real-Time Tracking: GPS and RFID-based location updates every 15 seconds, with geo-fencing alerts. - Usage Analytics: Asset utilization dashboards, predictive maintenance suggestions, and exportable reports. - User Management: Role-based access control, MFA, and SSO integration. Performance & Security Enhancements - System supports up to 50,000 concurrent assets with <1 sec delay in location updates. - AES-256 encryption applied to all data in transit and at rest. - Horizontal scaling on AWS using Kubernetes for high availability. Bug Fixes - Resolved map clustering issue for >500 assets. - Fixed CSV import validation errors for special characters. - Addressed WebSocket connection drops under heavy load. Delivery Timeline Phase Start Date End Date Deliverable Requirements Gathering Aug 5, 2025 Aug 20, 2025 Finalized requirements doc Development Sprint 1 Aug 21, 2025 Sep 30, 2025 Asset Registration + Tracking Development Sprint 2 Oct 1, 2025 Nov 15, 2025 Analytics + User Management QA & UAT Nov 16, 2025 Dec 10, 2025 Approved release candidate Launch Dec 15, 2025 Dec 15, 2025 Public release v1.0", "metadata": {"file_path": "C:/Users/gleblanc/OneDrive - Corporate Services, LLC/Documents/Python/Ingestor/nimbustrack_release_notes.pdf", "page_number": 1, "chunk_index": 0, "used_ocr": false, "original_native_text_length": 215}}
